The ``2-matrix_divided`` module
================================

Using ``matrix_divided``
-------------------------

importing function matrix_divided from module 2-matrix_divided
================================================================

    >>> matrix_divided = __import__("2-matrix_divided").matrix_divided

Now use it:
-----------

==============================
Test division with integers :
==============================

    >>> matrix = [
    ...	[1, 2, 3],
    ...	[4, 5, 6]
    ... ]
    >>> matrix_divided(matrix, 3)
    [[0.33, 0.67, 1.0], [1.33, 1.67, 2.0]]

==============================
Test division with floats :
==============================

    >>> matrix = [
    ...	[1.5, 2.5, 3.5],
    ...	[4.5, 5.5, 6.5]
    ... ]
    >>> matrix_divided(matrix, 2)
    [[0.75, 1.25, 1.75], [2.25, 2.75, 3.25]]

=======================
Test division by zero :
=======================

    >>> matrix = [
    ...	[1.5, 2.5, 3.5],
    ...	[4.5, 5.5, 6.5]
    ... ]
    >>> matrix_divided(matrix, 0)
    Traceback (most recent call last):
    ZeroDivisionError: division by zero

===========================
Test division by a string :
===========================

    >>> matrix = [
    ...	[1.5, 2.5, 3.5],
    ...	[4.5, 5.5, 6.5]
    ... ]
    >>> matrix_divided(matrix, 'aaa')
    Traceback (most recent call last):
    TypeError: div must be a number

=======================================
Test matrix must be a list of numbers :
=======================================

    >>> matrix = [
    ...	[1.5, 2.5, 3.5],
    ...	[4.5, 5.5, "aaa"]
    ... ]
    >>> matrix_divided(matrix, 4)
    Traceback (most recent call last):
    TypeError: matrix must be a matrix (list of lists) of integers/floats

=====================================
Test matrix must have the same size :
=====================================

    >>> matrix = [
    ...	[1.5, 2.5, 3.5],
    ...	[4.5, 5.5]
    ... ]
    >>> matrix_divided(matrix, 4)
    Traceback (most recent call last):
    TypeError: Each row of the matrix must have the same size

=======================================
Test missing arguments :
=======================================

    >>> matrix = [
    ...	[1.5, 2.5, 3.5],
    ...	[4.5, 5.5, "aaa"]
    ... ]
    >>> matrix_divided()
    Traceback (most recent call last):
    TypeError: matrix_divided() missing 2 required positional arguments: 'matrix' and 'div'
