The ``7-base_geometry.py`` module
============================

Using ``BaseGeometry``
---------------------

importing function BaseGeometry from module 7-base_geometry.py
 ========================================================

    >>> BaseGeometry = __import__('7-base_geometry').BaseGeometry

Now use it:
-----------

=====================================
Test : List with a positive integer :
=====================================

    >>> bg = BaseGeometry()
    >>> bg.integer_validator("my_int", 12)
    >>> bg.integer_validator("width", 89)

=====================================
Test : List with a negative integer :
=====================================

    >>> bg = BaseGeometry()
    >>> bg.integer_validator("my_int", -12)
    Traceback (most recent call last):
    ValueError: my_int must be greater than 0

    >>> bg = BaseGeometry()
    >>> bg.integer_validator("my_int", 12)
    >>> bg.integer_validator("width", -89)
    Traceback (most recent call last):
    ValueError: width must be greater than 0

==========================================================
Test : List with a string instead of a postitive integer :
==========================================================

    >>> bg = BaseGeometry()
    >>> bg.integer_validator("my_int", "Caroline")
    Traceback (most recent call last):
    TypeError: my_int must be an integer

====================
Test : Empty List  :
====================

    >>> bg = BaseGeometry()
    >>> bg.integer_validator("my_int")
    Traceback (most recent call last):
    TypeError: integer_validator() missing 1 required positional argument: 'value'

    >>> bg = BaseGeometry()
    >>> bg.integer_validator()
    Traceback (most recent call last):
    TypeError: integer_validator() missing 2 required positional arguments: 'name' and 'value'

=======================
Test : area function :
=======================

    >>> bg = BaseGeometry()
    >>> bg.area()
    Traceback (most recent call last):
    Exception: area() is not implemented

===============================
Test : List with a NULL value :
===============================

    >>> bg = BaseGeometry()
    >>> bg.integer_validator("my_int", 12)
    >>> bg.integer_validator("width", 0)
    Traceback (most recent call last):
    ValueError: width must be greater than 0

=====================================
Test : List with an invalid tuple :
=====================================

    >>> bg = BaseGeometry()
    >>> bg.integer_validator("my_int", (12,))
    Traceback (most recent call last):
    TypeError: my_int must be an integer

=====================================
Test : List with None input :
=====================================

    >>> bg = BaseGeometry()
    >>> bg.integer_validator("my_int", None)
    Traceback (most recent call last):
    TypeError: my_int must be an integer

=====================================
Test : List with another list :
=====================================

    >>> bg = BaseGeometry()
    >>> bg.integer_validator("my_int", {1, 6, 7})
    Traceback (most recent call last):
    TypeError: my_int must be an integer

=====================================
Test : List with a bool as parameter :
=====================================

    >>> bg = BaseGeometry()
    >>> bg.integer_validator("my_int", False)
    Traceback (most recent call last):
    TypeError: my_int must be an integer

=====================
Test : with array  :
=====================

    >>> bg = BaseGeometry()
    >>> bg.integer_validator("my_int", [4])
    Traceback (most recent call last):
    TypeError: my_int must be an integer
    